In [3]:
#install library
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv('agora.csv') # upload csv file
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [6]:
df.isnull().sum() #check null value

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [7]:
#handle NaN/null value
mean = df.Transport.mean()
median = df.Transport.median()

In [8]:
mean

215331.73244897963

In [9]:
median

214634.81

In [10]:
df.Transport = df.Transport.fillna(median) #fill NaN value

In [11]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# Encoding

In [12]:
#check unique column
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [13]:
df.Area = df.Area.replace(['Dhaka', 'Ctg', 'Rangpur'],[3,2,1])

In [14]:
df.Area.head()

0    3
1    2
2    1
3    3
4    1
Name: Area, dtype: int64

In [15]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     3  192261.83
1        162597.70       151377.59  443898.53     2  191792.06
2        153441.51       101145.55  407934.54     1  191050.39
3        144372.41       118671.85  383199.62     3  182901.99
4        142107.34        91391.77  366168.42     1  166187.94

In [16]:
df = pd.read_csv('agora.csv') # upload csv file
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Label Encoding

In [17]:
from sklearn.preprocessing import LabelEncoder

In [ ]:
df = pd.read_csv('agora.csv') # upload csv file
df.head()

In [ ]:
label = LabelEncoder()

In [ ]:
df.Area = label.fit_transform(df['Area'])

In [ ]:
df.head()

In [25]:
#loop
for column in df.columns:
    if df[column].dtype == np.number:
        continue
    df[column] = LabelEncoder().fit_transform(df[column])

C:\Users\Rifat Ahmed\AppData\Local\Temp\ipykernel_1884\1864815751.py:3: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df[column].dtype == np.number:

In [26]:
df.Area.head()

0    1
1    0
2    2
3    1
4    2
Name: Area, dtype: int64

# One Hot Encoding

In [27]:
df = pd.read_csv('agora.csv') # upload csv file
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [52]:
dummies = pd.get_dummies(df.Area)

In [53]:
dummies.head()

   Ctg  Dhaka  Rangpur
0    0      1        0
1    1      0        0
2    0      0        1
3    0      1        0
4    0      0        1

In [39]:
new_df = df.drop('Area', axis=1)

In [41]:
new_df.head()

   Marketing Spend  Administration  Transport     Profit
0        114523.61       136897.80  471784.10  192261.83
1        162597.70       151377.59  443898.53  191792.06
2        153441.51       101145.55  407934.54  191050.39
3        144372.41       118671.85  383199.62  182901.99
4        142107.34        91391.77  366168.42  166187.94

In [42]:
marged = pd.concat([new_df, dummies], axis=1)

In [44]:
marged.head()

   Marketing Spend  Administration  Transport     Profit  Dhaka  Rangpur
0        114523.61       136897.80  471784.10  192261.83      1        0
1        162597.70       151377.59  443898.53  191792.06      0        0
2        153441.51       101145.55  407934.54  191050.39      0        1
3        144372.41       118671.85  383199.62  182901.99      1        0
4        142107.34        91391.77  366168.42  166187.94      0        1

# Ordinal Encoder

In [54]:
df = pd.read_csv('agora.csv') # upload csv file
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [57]:
from sklearn.preprocessing import OrdinalEncoder

In [58]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [59]:
city_list = ['Dhaka', 'Ctg', 'Rangpur']

In [60]:
ordinal = OrdinalEncoder(categories=[city_list])

In [62]:
encoded_values = ordinal.fit_transform(df[['Area']])

In [64]:
new_area = pd.DataFrame(encoded_values, columns = ['Area'])

In [66]:
new_area.head()

   Area
0   0.0
1   1.0
2   2.0
3   0.0
4   2.0

In [68]:
df.Area = new_area

In [69]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10   0.0  192261.83
1        162597.70       151377.59  443898.53   1.0  191792.06
2        153441.51       101145.55  407934.54   2.0  191050.39
3        144372.41       118671.85  383199.62   0.0  182901.99
4        142107.34        91391.77  366168.42   2.0  166187.94

# Home work

In [76]:
df = pd.read_csv('agora.csv') # upload csv file
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [77]:
drop_area = df.drop('Area', axis=1)

In [80]:
drop_area.head()

   Marketing Spend  Administration  Transport     Profit
0        114523.61       136897.80  471784.10  192261.83
1        162597.70       151377.59  443898.53  191792.06
2        153441.51       101145.55  407934.54  191050.39
3        144372.41       118671.85  383199.62  182901.99
4        142107.34        91391.77  366168.42  166187.94

In [83]:
new_area.head()

   Area
0   0.0
1   1.0
2   2.0
3   0.0
4   2.0

In [84]:
new_set = pd.concat([drop_area, new_area], axis=1)

In [85]:
new_set.head()

   Marketing Spend  Administration  Transport     Profit  Area
0        114523.61       136897.80  471784.10  192261.83   0.0
1        162597.70       151377.59  443898.53  191792.06   1.0
2        153441.51       101145.55  407934.54  191050.39   2.0
3        144372.41       118671.85  383199.62  182901.99   0.0
4        142107.34        91391.77  366168.42  166187.94   2.0

# Hashing Encoding

In [86]:
df = pd.read_csv('agora.csv') # upload csv file
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [96]:
import category_encoders as ce

In [105]:
encoders = ce.HashingEncoder(cols='Area', n_components=3)

In [106]:
col = encoders.fit_transform(df)

In [107]:
col.head()

   col_0  col_1  col_2  Marketing Spend  Administration  Transport     Profit
0      0      1      0        114523.61       136897.80  471784.10  192261.83
1      0      0      1        162597.70       151377.59  443898.53  191792.06
2      1      0      0        153441.51       101145.55  407934.54  191050.39
3      0      1      0        144372.41       118671.85  383199.62  182901.99
4      1      0      0        142107.34        91391.77  366168.42  166187.94